# 1) დაპრინტეთ Hello world
# 2) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი.
# 3) შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია (ასევე კომენტარის სახით აღწერეთ რა არის კონკატენაცია).
# 4) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი, შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)
# 5) გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი
# 6) შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)
# 7) გაიხსენეთ ლოგიკური ოპერატორი და ჩამოწერეთ ყველა კომბინაცია რაც საჭიროა (სულ უნდა იყოს რვა, გაიხსენეთ ნასწავლიდან)
# 8) შეურიეთ ერთმანეთს ლოგიკური და შედარების ოპერატორები და მოიყვანეთ 5 მაგალითი
# 9) შექმენით for loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
# 10) შექმენით რიცხვების list'ი, შექმენით for loop'ი list'ის რიცხვების ჯამის გამოსათვლელად.
# 11) შექმენით for loop'ი თითოეული სიმბოლოს დასაბეჭდად სტრინგში -> "Hello, World!".
# 12) შექმენით while loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
# 13) შექმენით while loop'ი რომელიც დათვლის რიცხვებს 1დან 100მდე თუმცა გამოტოვებს რიცხვებს 50დან 60მდე.
# 14) შექმენით while loop'ი, რომელიც დაიწყებს რიცხვების შეკრებას 1-დან, სანამ ჯამი არ გაუტოლდება 50-ს.
# 15) შექმენით ფუნქცია რომელიც მომხმარებელს შემოატანინებს რიცხვს და დაპრინტავს ეს რიცხვი თუ იყოფა 3ზე ან 5ზე ან ორივეზე
# 16) შექმენით ფუნქცია რომელსაც გადაეცემა რიცხვების სია,თქვენი მოვალეობააა გამოითვალე ამ სიის საშუალო არითმეტიკული. test case: [1,3,4,5,2] | output: 3
# 17) შექმენით ფუნქცია რომელსაც გადაეცემა რაიმე sting,თქვენი მოვალეობაა ყოველ მეორე ინდექსზე მყოფი ასო გახადოს დიდი (upper). test case: hello | output: HeLlO
# 18) შექმენით ფუნქცია რომელსაც გადაეცემა  რიცხვების სია,თქვენი მოვალეობააა შექმნათ ახალი სია და ამ ახალ სიაში გამოიტანოთ ყოველი რიცხვის კვადრატი (append) და შემდეგ დააბრუნეთ ახალი სია.
# test case: [3,12,5,2,6] | output: [9,144,25,4,36]
# 19) გაიხსენეთ ყველა list'ის და string'ის მეთოდები და გამოიყენეთ თავისი მაგალითებით



print("hello world")


int=2
int1=5
print(int1+int)

str1=("nika")
str2=("qarcivadze")
print(str1+str2)
# konkatenacia nishnavs 2 stringis sheertebas

int1=438
int2=328
print(int1/int2)


# implicit da explicit qviat 


