##2) შექმენით ცვლადი num, რომლის მნიშვნელობასაც შემოიტანს მომხმარებელი 
# (გამოიყენეთ input() ფუნქცია). თუ ეს რიცხვი ტოლი იქნება 18ის მაშინ გამოუტანეთ რომ
#  მან მოიგო სათამაშო დინოზავრი, თუ ეს რიცხვი ტოლი იქნება 33ის მაშინ გამოუტანეთ რომ 
# მან მოიგო სათამაშო კურდღელი, ყველა სხვა შემთხვევაში გამოუტანეთ რომ ვერაფერი ვერ მოიგო
#  და მომავალში თავიდან სცადოს.
#3) დაწერეთ if-else condition კოდი: თუ მომხმარებლის შემოტანილი ასაკი ნაკლებია 13ზე,
#  დაუპრინტეთ "You are kid",  თუ მეტია 13ზე და ნაკლებია 20ზე, დაუპრინტეთ "You are teenager",
#  თუ მეტია 20'ზე, დაუპრინტეთ "You are grown up".
#4) შექმენით for loop'ი (range(20)'ით), შიგნით კი დაწერეთ ასეთი if-else condition'ი: თუ
#  i (საიტერაციო ცვლადი) ნაკლებია ან ტოლია 10'ის მაშინ გამოიტანოს "Hello world"ები, თუ მეტია 
# 10'ზე მაშინ გამოიტანოს "Goodbye world"ები.



num = int(input("შეიყვანეთ რიცხვი: "))
if num == 18:
    print("მან მოიგო სათამაშო დინოზავრი")
elif num == 33:
    print("მან მოიგო სათამაშო კურდღელი")
else:
    print("ვერაფერი ვერ მოიგო და მომავალში თავიდან სცადოს")


age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if age < 13:
    print("You are kid")
elif 13 <= age < 20:
    print("You are teenager")
else:
    print("You are grown up")



for i in range(20):
    if i <= 10:
        print("Hello world")
    else:
        print("Goodbye world") 
   
