# 4) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი.
# 5) შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია (ასევე კომენტარის სახით აღწერეთ რა არის კონკატენაცია).
# 6) შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი, შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)
# 7) გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი
# 8) შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)
# 9) გაიხსენეთ ლოგიკური ოპერატორი და ჩამოწერეთ ყველა კომბინაცია რაც საჭიროა (სულ უნდა იყოს რვა, გაიხსენეთ ნასწავლიდან
# 10) შეურიეთ ერთმანეთს ლოგიკური და შედარების ოპერატორები და მოიყვანეთ 5 მაგალითი
# 11) შექმენით for loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
# 12) შექმენით ახალი list'ი, გადაატარეთ for loop'ი და ცალ-ცალკე გამოიტანეთ ყველა ლისტის ელემენტი
# 13) შექმენით string ტიპის ცვლადი, გადაატარეთ for loop'ი და ცალ-ცალკე გამოიტანეთ ყველა სიმბოლო
task
num1=(23)
num2=(29)
num3=(num1+num2)
print(num3)

num1=("banani")
num2=("apple")
num3=(num1+num2)
print(num3)

task5
num1=(902)
num2=(374)
num3=(num1/num2)
print(num3)

task6
a=(23)
b=(12)
print(a>b)

task7
a=(28)
b=(42)
print(a<b)


a=(57)
b=(57)
print(a==b)


a=(85)
b=(23)
print(a>=b)


a=(835)
b=(213)
print(a!=b)


a=(25)
b=(213)
print(a<=b)




num1=(1>3)
num2=(5<3)
num3=(num1==num2)
print(num3)





task10
print(10 < 51 or 45 > 4)
print(10 < 176 or 65 > 2)
print(10 < 13 or 45 > 4)
print(10 < 11 or 45 > 32)
print(10 < 51 or 12 > 6)



task11
for i in range(11):
    print(i)


task12
list5 = [1, 2, 3, 4, 5, 6, 7, 8 , 9]

for i in list5:
    print(i)


task13
list6 = ["sandro", "zuka" , "data" , "nika" , "luka" , "atuka" ,"erekle"]


for i in list6:
    print

#task 14 



my_list = ["sandro", "esne unda mekna", "sworia?"]

list7 = my_list[::-1]

print(list7)



 

